Revit 2027 API
Application.NewInstanceBinding Method
Creates a new empty instance binding object.
Namespace: Autodesk.Revit.Creation
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public InstanceBinding NewInstanceBinding()
Public Function NewInstanceBinding As InstanceBinding
public:
InstanceBinding^ NewInstanceBinding()
member NewInstanceBinding : unit -> InstanceBinding
Return Value
InstanceBinding
A new instance binding object.
Remarks
Instance binding objects are used for attaching shared parameter definitions to all instances of an element within a category. Categories can be added to the instance binding via the Categories property of the InstanceBinding object
See Also
Reference
Application Class
NewInstanceBinding Overload
Autodesk.Revit.Creation Namespace